#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, РежимЗаписи, РежимПроведения)

	ТекстИзменения = "";			
	Запрос = Новый Запрос;
	Запрос.Текст =
			"ВЫБРАТЬ
			|	ВКМ_ОбслуживаниеКлиентов.Специалист,
			|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот,
			|	ВКМ_ОбслуживаниеКлиентов.ВремяНачалаРабот,
			|	ВКМ_ОбслуживаниеКлиентов.ВремяОкончанияРабот
			|ИЗ
			|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
			|ГДЕ
			|	ВКМ_ОбслуживаниеКлиентов.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
	РезультатЗапроса = Запрос.Выполнить();
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		
		ТекстИзменения = СтрШаблон("Добавлен документ %1 от %2. Специалист %3, дата проведения работ: %4, время начала работ: %5, время окончания работ: %6",
			Объект.Номер, Объект.Дата, Объект.Специалист, Объект.ДатаПроведенияРабот,
			Формат(Объект.ВремяНачалаРабот, "ДЛФ=T"), Формат(Объект.ВремяОкончанияРабот, "ДЛФ=T"));
			
		НовыйЭлемент = Справочники.ВКМ_УведомленияБот.СоздатьЭлемент();
		НовыйЭлемент.Текст = ТекстИзменения;
		НовыйЭлемент.Записать();			
		
	Иначе
			
		ВыборкаДетальныеЗаписи.Следующий();
		ДатаПроведенияРабот = ВыборкаДетальныеЗаписи.ДатаПроведенияРабот;
		Специалист = ВыборкаДетальныеЗаписи.Специалист;
		ВремяНачалаРабот = ВыборкаДетальныеЗаписи.ВремяНачалаРабот;
		ВремяОкончанияРабот = ВыборкаДетальныеЗаписи.ВремяОкончанияРабот;
		
		Если ДатаПроведенияРабот <> Объект.ДатаПроведенияРабот Или Специалист <> Объект.Специалист Или
				ВремяНачалаРабот <> Объект.ВремяНачалаРабот Или
				ВремяОкончанияРабот <> Объект.ВремяОкончанияРабот Тогда
		
			ТекстИзменения = СтрШаблон("Изменен документ %1 от %2. Специалист %3, дата проведения работ: %4, время начала работ: %5, время окончания работ: %6",
				Объект.Номер, Объект.Дата, Специалист, ДатаПроведенияРабот,
				Формат(ВремяНачалаРабот, "ДЛФ=T"), Формат(ВремяОкончанияРабот, "ДЛФ=T"));

			НовыйЭлемент = Справочники.ВКМ_УведомленияБот.СоздатьЭлемент();
			НовыйЭлемент.Текст = ТекстИзменения;
			НовыйЭлемент.Записать();
			
		КонецЕсли;
			
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ Алиев А.З. Дата: 17.06.25, установка доступности
	
	НаименованиеПользователя = Пользователи.ТекущийПользователь().Наименование;
	
	Если НаименованиеПользователя <> "Администратор" Тогда
		
		ДоступностьТЧИКомментарий = (?(НаименованиеПользователя <> "Специалист", 0, 1));
		ЭтотОбъект.Элементы.ВыполненныеРаботы.Доступность = ДоступностьТЧИКомментарий;
		ЭтотОбъект.Элементы.Комментарий.Доступность = ДоступностьТЧИКомментарий;
		ЭтотОбъект.Элементы.Дата.Доступность = Не ДоступностьТЧИКомментарий;
		ЭтотОбъект.Элементы.Номер.Доступность = Не ДоступностьТЧИКомментарий;		
		ЭтотОбъект.Элементы.Клиент.Доступность = Не ДоступностьТЧИКомментарий;
		ЭтотОбъект.Элементы.Договор.Доступность = Не ДоступностьТЧИКомментарий;
		ЭтотОбъект.Элементы.ДатаПроведенияРабот.Доступность = Не ДоступностьТЧИКомментарий;
		ЭтотОбъект.Элементы.ВремяНачалаРабот.Доступность = Не ДоступностьТЧИКомментарий;
		ЭтотОбъект.Элементы.ВремяОкончанияРабот.Доступность = Не ДоступностьТЧИКомментарий;
		ЭтотОбъект.Элементы.Специалист.Доступность = Не ДоступностьТЧИКомментарий;
		ЭтотОбъект.Элементы.ОписаниеПроблемы.Доступность = Не ДоступностьТЧИКомментарий;
		ЭтотОбъект.Элементы.ВыпадающийСписокЦветов.Доступность = Не ДоступностьТЧИКомментарий;
		
	КонецЕсли;
	
	Соответствие = ОбработкаОбъект().КаталогWebЦветов();
	Для Каждого КЗ Из Соответствие Цикл
		НоваяСтрока = СписокWebЦветов.Добавить();
		НоваяСтрока.Представление = КЗ.Ключ;
		НоваяСтрока.Значение = КЗ.Значение;
	КонецЦикла;                                     

	СписокWebЦветов.СортироватьПоПредставлению();
	
	//--
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Для Каждого СтрокаЦвета Из СписокWebЦветов Цикл
		ЦветСтроки = СтрокаЦвета.Значение;
		ФормПробел = Новый ФорматированнаяСтрока("___",, ЦветСтроки, ЦветСтроки);
		Массив = Новый Массив;
		Массив.Добавить(ФормПробел);
		Массив.Добавить(СтрокаЦвета.Представление);
		
		СтрокаТекста = Новый ФорматированнаяСтрока(Массив);		
		
		Элементы.ВыпадающийСписокЦветов.СписокВыбора.Добавить(СтрокаЦвета.Представление, СтрокаТекста);
		
	КонецЦикла;

	Если ЗначениеЗаполнено(Объект.КодЦвета) Тогда
		
		RGB = ПолучитьЦветRGBНаСервере(Объект.КодЦвета);
		ИмяЦвета = СписокWebЦветов.НайтиПоЗначению(RGB);
		ВыпадающийСписокЦветов = ИмяЦвета;
		
	КонецЕсли;

    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	ПараметрыЗаписи.Вставить("ДатаПроведенияРабот", Объект.ДатаПроведенияРабот);
	
	Оповестить("Запись_ОбслуживаниеКлиентов", ПараметрыЗаписи, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ДатаНорм = ПроверкаДатДоговораНаКлиенте();
	
	Если Не ДатаНорм Тогда

		ДействияСОбъектом();
		
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыпадающийСписокЦветов) Тогда
		RGB = НайтиКодЦвета(ВыпадающийСписокЦветов);
		Объект.КодЦвета = RGB.Красный + RGB.Зеленый * 256 + RGB.Синий * 256 * 256;
	КонецЕсли;
	
	Объект.ВремяНачалаРабот = Объект.ВремяНачалаРабот - Секунда(Объект.ВремяНачалаРабот);
	Объект.ВремяОкончанияРабот = Объект.ВремяОкончанияРабот - Секунда(Объект.ВремяОкончанияРабот);
		
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Функция  ПолучитьЦветRGBНаСервере(КодЦвета)
	Возврат ВКМ_ОбслуживаниеКлиентов.ПолучитьЦветRGB(КодЦвета);
КонецФункции

&НаКлиенте
Функция НайтиКодЦвета(ИмяЦвета)
	
	RGB = Новый Цвет;
	
	Для Каждого СтрокаСпискаЦветов Из СписокWebЦветов Цикл
		
		Если СтрокаСпискаЦветов.Представление = ИмяЦвета Тогда
			RGB = СтрокаСпискаЦветов.Значение;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;

	Возврат RGB;
	
КонецФункции

&НаСервере
Функция ОбработкаОбъект()
	
	Возврат РеквизитФормыВЗначение("Объект");
	
КонецФункции

&НаСервере
Функция ПроверкаТекущегоПользователя()
	
	Возврат Пользователи.ТекущийПользователь() = "Специалист";
	
КонецФункции

&НаСервере
Процедура ДействияСОбъектом()
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон("Период действия договора не соответствует дате договора %1.", Формат(Объект.Дата,"ДЛФ=DD"));
	Сообщение.КлючДанных = Объект.Договор.Ссылка;
	Сообщение.ПутьКДанным = "Объект";
	Сообщение.Поле = "ВКМ_ДатаНачалаДействияДоговора";
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаСервере
Функция ПроверкаДатДоговораНаКлиенте()
	
	ОбъектДокумент = Объект.Договор.Ссылка.ПолучитьОбъект();
	
	Возврат ОбъектДокумент.ВКМ_ДатаНачалаДействияДоговора <= Объект.ДатаПроведенияРабот И 
			ОбъектДокумент.ВКМ_ДатаОкончанияДействияДоговора >= Объект.ДатаПроведенияРабот
		
КонецФункции

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

