
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТаблицаОтпускаСотрудников = ПолучитьИзВременногоХранилища(Параметры.СсылкаХранилища);
	
	Диаграмма.Очистить();
	Для Каждого Строка Из ТаблицаОтпускаСотрудников Цикл

		Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
		Точка.Текст = Строка.Сотрудник;
		
		Серия = Диаграмма.УстановитьСерию(Строка.ПризнакОтпуска);
		Если Не Серия.Значение Тогда
			Серия.Цвет = WEBЦвета.Бирюзовый;
			Серия.Текст = "Отпуск меньше 29 дней"
		Иначе
			Серия.Цвет = WebЦвета.Зеленый;
			Серия.Текст = "Отпуск больше 28 дней"			
		КонецЕсли;

		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
	КонецЦикла;
	
КонецПроцедуры
