#ОБласть ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.ЧасыКОплате), 0) КАК СуммаЧасыКОплате,
		|	ЕСТЬNULL(ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_СтоимостьЧасаРаботы, 0) КАК СтоимостьЧасаРаботы,
		|	ВКМ_ОбслуживаниеКлиентов.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиентов.Договор КАК Договор,
		|	ВКМ_ОбслуживаниеКлиентов.Договор.ВидДоговора КАК ВидДоговора,
		|	ЕСТЬNULL(СУММА(ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.ФактическиПотраченоЧасов), 0) КАК СуммаФактЧасов
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|		ПО ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.Ссылка = ВКМ_ОбслуживаниеКлиентов.Ссылка
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.Ссылка = &Ссылка
		|	И ВКМ_ОбслуживаниеКлиентов.Договор.ВидДоговора = &ВиДдоговора
		|	И ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_ДатаОкончанияДействияДоговора >= &Дата
		|	И ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_ДатаНачалаДействияДоговора <= &Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиентов.Клиент,
		|	ВКМ_ОбслуживаниеКлиентов.Договор,
		|	ВКМ_ОбслуживаниеКлиентов.Договор.ВидДоговора,
		|	ЕСТЬNULL(ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_СтоимостьЧасаРаботы, 0)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ВыборкаДетальныеЗаписи.СуммаЧасыКОплате;
		Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.СуммаЧасыКОплате * ВыборкаДетальныеЗаписи.СтоимостьЧасаРаботы;
		Движение.КоличествоФактЧасов = ВыборкаДетальныеЗаписи.СуммаФактЧасов;
		Движение.ФактСумма = ВыборкаДетальныеЗаписи.СуммаФактЧасов * ВыборкаДетальныеЗаписи.СтоимостьЧасаРаботы;

	КонецЦикла;
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Период КАК Период,
		|	СУММА(ЕСТЬNULL(ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.ФактическиПотраченоЧасов, 0)) КАК ФактическиПотраченоЧасов,
		|	СУММА(ЕСТЬNULL(ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.ЧасыКОплате, 0)) КАК ЧасыКОплате,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник.Категория КАК Категория
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
		|			&Период,
		|			Сотрудник.Ссылка = &Сотрудник
		|				И УчитыватьПроцент) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних,
		|	Документ.ВКМ_ОбслуживаниеКлиентов.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Период";
	
	Запрос.УстановитьПараметр("Период", ДатаПроведенияРабот);
	Запрос.УстановитьПараметр("Сотрудник", Специалист.Ссылка);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаПроведенияРабот;
		Движение.ЧасовКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплате;
		Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплате * Договор.ВКМ_СтоимостьЧасаРаботы * 
				ВыборкаДетальныеЗаписи.ПроцентОтРабот / 100;
		Движение.Сотрудник = Специалист;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти