#ОБласть ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.ЧасыКОплате), 0) КАК СуммаЧасыКОплате,
		|	ЕСТЬNULL(ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_СтоимостьЧасаРаботы, 0) КАК СтоимостьЧасаРаботы,
		|	ВКМ_ОбслуживаниеКлиентов.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиентов.Договор КАК Договор,
		|	ВКМ_ОбслуживаниеКлиентов.Договор.ВидДоговора КАК ДоговорВидДоговора
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|		ПО ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.Ссылка = ВКМ_ОбслуживаниеКлиентов.Ссылка
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.Ссылка = &Ссылка
		|	И ВКМ_ОбслуживаниеКлиентов.Договор.ВидДоговора = &ВиДдоговора
		|	И ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_ДатаОкончанияДействияДоговора >= &Дата
		|	И ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_ДатаНачалаДействияДоговора <= &Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиентов.Клиент,
		|	ВКМ_ОбслуживаниеКлиентов.Договор,
		|	ВКМ_ОбслуживаниеКлиентов.Договор.ВидДоговора,
		|	ЕСТЬNULL(ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_СтоимостьЧасаРаботы, 0)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ВыборкаДетальныеЗаписи.СуммаЧасыКОплате;
		Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.СуммаЧасыКОплате * ВыборкаДетальныеЗаписи.СтоимостьЧасаРаботы;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти