#ОБласть ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.ЧасыКОплате), 0) КАК СуммаЧасыКОплате,
		|	ЕСТЬNULL(ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_СтоимостьЧасаРаботы, 0) КАК СтоимостьЧасаРаботы,
		|	ВКМ_ОбслуживаниеКлиентов.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиентов.Договор КАК Договор,
		|	ВКМ_ОбслуживаниеКлиентов.Договор.ВидДоговора КАК ВидДоговора,
		|	ЕСТЬNULL(СУММА(ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.ФактическиПотраченоЧасов), 0) КАК СуммаФактЧасов
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|		ПО ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.Ссылка = ВКМ_ОбслуживаниеКлиентов.Ссылка
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.Ссылка = &Ссылка
		|	И ВКМ_ОбслуживаниеКлиентов.Договор.ВидДоговора = &ВиДдоговора
		|	И ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_ДатаОкончанияДействияДоговора >= &Дата
		|	И ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_ДатаНачалаДействияДоговора <= &Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиентов.Клиент,
		|	ВКМ_ОбслуживаниеКлиентов.Договор,
		|	ВКМ_ОбслуживаниеКлиентов.Договор.ВидДоговора,
		|	ЕСТЬNULL(ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_СтоимостьЧасаРаботы, 0)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("Дата", ДатаПроведенияРабот);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ВыборкаДетальныеЗаписи.СуммаЧасыКОплате;
		Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.СуммаЧасыКОплате * ВыборкаДетальныеЗаписи.СтоимостьЧасаРаботы;
		Движение.КоличествоФактЧасов = ВыборкаДетальныеЗаписи.СуммаФактЧасов;
		Движение.ФактСумма = ВыборкаДетальныеЗаписи.СуммаФактЧасов * ВыборкаДетальныеЗаписи.СтоимостьЧасаРаботы;

	КонецЦикла;
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Период КАК Период,
		|	СУММА(ЕСТЬNULL(ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.ФактическиПотраченоЧасов, 0)) КАК ФактическиПотраченоЧасов,
		|	СУММА(ЕСТЬNULL(ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.ЧасыКОплате, 0)) КАК ЧасыКОплате,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник.Категория КАК Категория
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
		|			&Период,
		|			Сотрудник.Ссылка = &Сотрудник
		|				И УчитыватьПроцент) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних,
		|	Документ.ВКМ_ОбслуживаниеКлиентов.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Период";
	
	Запрос.УстановитьПараметр("Период", ДатаПроведенияРабот);
	Запрос.УстановитьПараметр("Сотрудник", Специалист.Ссылка);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("В регистре сведений ""Условия оплаты сотрудников"" нет данных о процентах по сотруднику %1.", 
				Специалист);
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаПроведенияРабот;
		Движение.ЧасовКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплате;
		Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплате * Договор.ВКМ_СтоимостьЧасаРаботы * 
				ВыборкаДетальныеЗаписи.ПроцентОтРабот / 100;
		Движение.Сотрудник = Специалист;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее
//Возвращает таблицу Web-цветов с абсолютными цветами.
//
// Возвращаемое значение:
//	Соответствие из Строка - Соответствие с цветами.
Функция КаталогWebЦветов() Экспорт
	
	Соответствие = Новый Соответствие;
    	
	Соответствие.Вставить(WebЦвета.Аквамарин,					КонструкторЦвета(127, 255, 212));
	Соответствие.Вставить(WebЦвета.АкварельноСиний,				КонструкторЦвета(240, 248, 255));
	Соответствие.Вставить(WebЦвета.АнтикБелый,					КонструкторЦвета(250, 235, 215));
	Соответствие.Вставить(WebЦвета.Бежевый,						КонструкторЦвета(245, 245, 220));
	Соответствие.Вставить(WebЦвета.Белоснежный,					КонструкторЦвета(255, 250, 250));
	Соответствие.Вставить(WebЦвета.Белый,						КонструкторЦвета(255, 255, 255));
	Соответствие.Вставить(WebЦвета.Бирюзовый,					КонструкторЦвета(064, 224, 208));
	Соответствие.Вставить(WebЦвета.БледноБирюзовый,				КонструкторЦвета(175, 238, 238));
	Соответствие.Вставить(WebЦвета.БледноЗеленый,				КонструкторЦвета(152, 251, 152));
	Соответствие.Вставить(WebЦвета.БледноЗолотистый,			КонструкторЦвета(238, 232, 170));
	Соответствие.Вставить(WebЦвета.БледноКрасноФиолетовый,		КонструкторЦвета(219, 112, 147));
	Соответствие.Вставить(WebЦвета.БледноЛиловый,				КонструкторЦвета(230, 230, 250));
	Соответствие.Вставить(WebЦвета.БледноМиндальный,			КонструкторЦвета(255, 235, 205));
	Соответствие.Вставить(WebЦвета.БледноСиреневый,				КонструкторЦвета(216, 191, 216));
	Соответствие.Вставить(WebЦвета.Васильковый,					КонструкторЦвета(100, 149, 237));
	Соответствие.Вставить(WebЦвета.ВесеннеЗеленый,				КонструкторЦвета(000, 255, 127));
	Соответствие.Вставить(WebЦвета.Голубой,						КонструкторЦвета(166, 202, 240));
	Соответствие.Вставить(WebЦвета.ГолубойСКраснымОттенком,		КонструкторЦвета(255, 240, 245));
	Соответствие.Вставить(WebЦвета.ГолубойСоСтальнымОттенком,	КонструкторЦвета(176, 196, 222));
	Соответствие.Вставить(WebЦвета.ГрифельноСерый,				КонструкторЦвета(112, 128, 144));
	Соответствие.Вставить(WebЦвета.ГрифельноСиний,				КонструкторЦвета(106, 090, 205));
	Соответствие.Вставить(WebЦвета.Древесный,					КонструкторЦвета(222, 184, 135));
	Соответствие.Вставить(WebЦвета.ДымчатоБелый,				КонструкторЦвета(245, 245, 245));
	Соответствие.Вставить(WebЦвета.ЖелтоЗеленый,				КонструкторЦвета(154, 205, 050));
	Соответствие.Вставить(WebЦвета.Желтый,						КонструкторЦвета(255, 255, 000));
	Соответствие.Вставить(WebЦвета.ЗамшаСветлый,				КонструкторЦвета(255, 228, 181));
	Соответствие.Вставить(WebЦвета.ЗеленаяЛужайка,				КонструкторЦвета(124, 252, 000));
	Соответствие.Вставить(WebЦвета.ЗеленоЖелтый,				КонструкторЦвета(173, 255, 047));
	Соответствие.Вставить(WebЦвета.ЗеленоватоЖелтый,			КонструкторЦвета(127, 255, 000));
	Соответствие.Вставить(WebЦвета.ЗеленоватоЛимонный,			КонструкторЦвета(000, 255, 000));
	Соответствие.Вставить(WebЦвета.Зеленый,						КонструкторЦвета(000, 128, 000));
	Соответствие.Вставить(WebЦвета.ЗеленыйЛес,					КонструкторЦвета(034, 139, 034));
	Соответствие.Вставить(WebЦвета.Золотистый,					КонструкторЦвета(218, 165, 032));
	Соответствие.Вставить(WebЦвета.Золотой,						КонструкторЦвета(255, 215, 000));
	Соответствие.Вставить(WebЦвета.Индиго,						КонструкторЦвета(075, 000, 130));
	Соответствие.Вставить(WebЦвета.Киноварь,					КонструкторЦвета(205, 092, 092));
	Соответствие.Вставить(WebЦвета.Кирпичный,					КонструкторЦвета(178, 034, 034));
	Соответствие.Вставить(WebЦвета.КожаноКоричневый,			КонструкторЦвета(139, 069, 019));
	Соответствие.Вставить(WebЦвета.Коралловый,					КонструкторЦвета(255, 127, 080));
	Соответствие.Вставить(WebЦвета.Коричневый,					КонструкторЦвета(165, 042, 042));
	Соответствие.Вставить(WebЦвета.КоролевскиГолубой,			КонструкторЦвета(065, 105, 225));
	Соответствие.Вставить(WebЦвета.КрасноФиолетовый,			КонструкторЦвета(208, 032, 144));
	Соответствие.Вставить(WebЦвета.Красный,						КонструкторЦвета(255, 000, 000));
	Соответствие.Вставить(WebЦвета.Кремовый,					КонструкторЦвета(255, 251, 240));
	Соответствие.Вставить(WebЦвета.Лазурный,					КонструкторЦвета(240, 255, 255));
	Соответствие.Вставить(WebЦвета.ЛимонноЗеленый,				КонструкторЦвета(050, 205, 050));
	Соответствие.Вставить(WebЦвета.Лимонный,					КонструкторЦвета(255, 250, 205));
	Соответствие.Вставить(WebЦвета.Лосось,						КонструкторЦвета(250, 128, 114));
	Соответствие.Вставить(WebЦвета.ЛососьСветлый,				КонструкторЦвета(255, 160, 122));
	Соответствие.Вставить(WebЦвета.ЛососьТемный,				КонструкторЦвета(233, 150, 122));
	Соответствие.Вставить(WebЦвета.Льняной,						КонструкторЦвета(250, 240, 230));
	Соответствие.Вставить(WebЦвета.Малиновый,					КонструкторЦвета(220, 020, 060));
	Соответствие.Вставить(WebЦвета.МятныйКрем,					КонструкторЦвета(245, 255, 250));
	Соответствие.Вставить(WebЦвета.НавахоБелый,					КонструкторЦвета(255, 222, 173));
	Соответствие.Вставить(WebЦвета.НасыщенноНебесноГолубой,		КонструкторЦвета(000, 191, 255));
	Соответствие.Вставить(WebЦвета.НасыщенноРозовый,			КонструкторЦвета(255, 020, 147));
	Соответствие.Вставить(WebЦвета.НебесноГолубой,				КонструкторЦвета(135, 206, 235));
	Соответствие.Вставить(WebЦвета.НейтральноАквамариновый,		КонструкторЦвета(102, 205, 170));
	Соответствие.Вставить(WebЦвета.НейтральноБирюзовый,			КонструкторЦвета(072, 209, 204));
	Соответствие.Вставить(WebЦвета.НейтральноВесеннеЗеленый,	КонструкторЦвета(000, 250, 154));
	Соответствие.Вставить(WebЦвета.НейтральноГрифельноСиний,	КонструкторЦвета(123, 104, 238));
	Соответствие.Вставить(WebЦвета.НейтральноЗеленый,			КонструкторЦвета(192, 220, 192));
	Соответствие.Вставить(WebЦвета.НейтральноКоричневый,		КонструкторЦвета(205, 133, 63));
	Соответствие.Вставить(WebЦвета.НейтральноПурпурный,			КонструкторЦвета(147, 112, 219));
	Соответствие.Вставить(WebЦвета.НейтральноСерый,				КонструкторЦвета(160, 160, 164));
	Соответствие.Вставить(WebЦвета.НейтральноСиний,				КонструкторЦвета(000, 000, 205));
	Соответствие.Вставить(WebЦвета.НейтральноФиолетовоКрасный,	КонструкторЦвета(199, 021, 133));
	Соответствие.Вставить(WebЦвета.Оливковый,					КонструкторЦвета(128, 128, 000));
	Соответствие.Вставить(WebЦвета.ОранжевоКрасный,				КонструкторЦвета(255, 069, 000));
	Соответствие.Вставить(WebЦвета.Оранжевый,					КонструкторЦвета(255, 165, 000));
	Соответствие.Вставить(WebЦвета.Орхидея,						КонструкторЦвета(218, 112, 214));
	Соответствие.Вставить(WebЦвета.ОрхидеяНейтральный,			КонструкторЦвета(186, 085, 211));
	Соответствие.Вставить(WebЦвета.ОрхидеяТемный,				КонструкторЦвета(153, 050, 204));
	Соответствие.Вставить(WebЦвета.Охра,						КонструкторЦвета(160, 082, 045));
	Соответствие.Вставить(WebЦвета.Перламутровый,				КонструкторЦвета(255, 245, 238));
	Соответствие.Вставить(WebЦвета.Персиковый,					КонструкторЦвета(255, 218, 185));
	Соответствие.Вставить(WebЦвета.ПесочноКоричневый,			КонструкторЦвета(244, 164, 096));
	Соответствие.Вставить(WebЦвета.ПолночноСиний,				КонструкторЦвета(025, 025, 112));
	Соответствие.Вставить(WebЦвета.ПризрачноБелый,				КонструкторЦвета(248, 248, 255));
	Соответствие.Вставить(WebЦвета.Пурпурный,					КонструкторЦвета(128, 000, 128));
	Соответствие.Вставить(WebЦвета.Пшеничный,					КонструкторЦвета(245, 222, 179));
	Соответствие.Вставить(WebЦвета.РозовоКоричневый,			КонструкторЦвета(188, 143, 143));
	Соответствие.Вставить(WebЦвета.Розовый,						КонструкторЦвета(255, 192, 203));
	Соответствие.Вставить(WebЦвета.Роса,						КонструкторЦвета(240, 255, 240));
	Соответствие.Вставить(WebЦвета.РыжеватоКоричневый,			КонструкторЦвета(210, 180, 140));
	Соответствие.Вставить(WebЦвета.СветлоГрифельноСерый,		КонструкторЦвета(119, 136, 153));
	Соответствие.Вставить(WebЦвета.СветлоГрифельноСиний,		КонструкторЦвета(132, 112, 255));
	Соответствие.Вставить(WebЦвета.СветлоЖелтый,				КонструкторЦвета(255, 255, 224));
	Соответствие.Вставить(WebЦвета.СветлоЖелтыйЗолотистый,		КонструкторЦвета(250, 250, 210));
	Соответствие.Вставить(WebЦвета.СветлоЗеленый,				КонструкторЦвета(144, 238, 144));
	Соответствие.Вставить(WebЦвета.СветлоЗолотистый,			КонструкторЦвета(255, 236, 139));
	Соответствие.Вставить(WebЦвета.СветлоКоралловый,			КонструкторЦвета(240, 128, 128));
	Соответствие.Вставить(WebЦвета.СветлоКоричневый,			КонструкторЦвета(255, 228, 196));
	Соответствие.Вставить(WebЦвета.СветлоНебесноГолубой,		КонструкторЦвета(135, 206, 250));
	Соответствие.Вставить(WebЦвета.СветлоРозовый,				КонструкторЦвета(255, 182, 193));
	Соответствие.Вставить(WebЦвета.СветлоСерый,					КонструкторЦвета(192, 192, 192));
	Соответствие.Вставить(WebЦвета.СеребристоСерый,				КонструкторЦвета(220, 220, 220));
	Соответствие.Вставить(WebЦвета.Серебряный,					КонструкторЦвета(192, 192, 192));
	Соответствие.Вставить(WebЦвета.СероСиний,					КонструкторЦвета(095, 158, 160));
	Соответствие.Вставить(WebЦвета.Серый,						КонструкторЦвета(128, 128, 128));
	Соответствие.Вставить(WebЦвета.СинеСерый,					КонструкторЦвета(030, 144, 255));
	Соответствие.Вставить(WebЦвета.СинеФиолетовый,				КонструкторЦвета(138, 043, 226));
	Соответствие.Вставить(WebЦвета.Синий,						КонструкторЦвета(000, 000, 255));
	Соответствие.Вставить(WebЦвета.СинийСПороховымОттенком,		КонструкторЦвета(176, 224, 230));
	Соответствие.Вставить(WebЦвета.СинийСоСтальнымОттенком,		КонструкторЦвета(070, 130, 180));
	Соответствие.Вставить(WebЦвета.Сливовый,					КонструкторЦвета(221, 160, 221));
	Соответствие.Вставить(WebЦвета.СлоноваяКость,				КонструкторЦвета(255, 255, 240));
	Соответствие.Вставить(WebЦвета.СтароеКружево,				КонструкторЦвета(253, 245, 230));
	Соответствие.Вставить(WebЦвета.ТемноБирюзовый,				КонструкторЦвета(000, 206, 209));
	Соответствие.Вставить(WebЦвета.ТемноБордовый,				КонструкторЦвета(128, 000, 000));
	Соответствие.Вставить(WebЦвета.ТемноГрифельноСерый,			КонструкторЦвета(047, 079, 079));
	Соответствие.Вставить(WebЦвета.ТемноГрифельноСиний,			КонструкторЦвета(072, 061, 139));
	Соответствие.Вставить(WebЦвета.ТемноЗеленый,				КонструкторЦвета(000, 100, 000));
	Соответствие.Вставить(WebЦвета.ТемноЗолотистый,				КонструкторЦвета(184, 134, 011));
	Соответствие.Вставить(WebЦвета.ТемноКрасный,				КонструкторЦвета(139, 000, 000));
	Соответствие.Вставить(WebЦвета.ТемноОливковоЗеленый,		КонструкторЦвета(085, 107, 47));
	Соответствие.Вставить(WebЦвета.ТемноОранжевый,				КонструкторЦвета(255, 140, 000));
	Соответствие.Вставить(WebЦвета.ТемноСерый,					КонструкторЦвета(169, 169, 169));
	Соответствие.Вставить(WebЦвета.ТемноСиний,					КонструкторЦвета(000, 000, 139));
	Соответствие.Вставить(WebЦвета.ТемноФиолетовый,				КонструкторЦвета(148, 000, 211));
	Соответствие.Вставить(WebЦвета.ТеплоРозовый,				КонструкторЦвета(255, 105, 180));
	Соответствие.Вставить(WebЦвета.Томатный,					КонструкторЦвета(255, 099, 071));
	Соответствие.Вставить(WebЦвета.ТопленоеМолоко,				КонструкторЦвета(255, 239, 213));
	Соответствие.Вставить(WebЦвета.ТусклоОливковый,				КонструкторЦвета(107, 142, 035));
	Соответствие.Вставить(WebЦвета.ТусклоРозовый,				КонструкторЦвета(255, 228, 225));
	Соответствие.Вставить(WebЦвета.ТусклоСерый,					КонструкторЦвета(105, 105, 105));
	Соответствие.Вставить(WebЦвета.Ультрамарин,					КонструкторЦвета(000, 000, 128));
	Соответствие.Вставить(WebЦвета.Фиолетовый,					КонструкторЦвета(238, 130, 238));
	Соответствие.Вставить(WebЦвета.Фуксин,						КонструкторЦвета(255, 000, 255));
	Соответствие.Вставить(WebЦвета.ФуксинТемный,				КонструкторЦвета(139, 000, 139));
	Соответствие.Вставить(WebЦвета.Фуксия,						КонструкторЦвета(255, 000, 255));
	Соответствие.Вставить(WebЦвета.Хаки,						КонструкторЦвета(240, 230, 140));
	Соответствие.Вставить(WebЦвета.ХакиТемный,					КонструкторЦвета(189, 183, 107));
	Соответствие.Вставить(WebЦвета.ЦветМорскойВолны,			КонструкторЦвета(046, 139, 087));
	Соответствие.Вставить(WebЦвета.ЦветМорскойВолныНейтральный,	КонструкторЦвета(060, 179, 113));
	Соответствие.Вставить(WebЦвета.ЦветМорскойВолныСветлый,		КонструкторЦвета(032, 178, 170));
	Соответствие.Вставить(WebЦвета.ЦветМорскойВолныТемный,		КонструкторЦвета(143, 188, 139));
	Соответствие.Вставить(WebЦвета.ЦветокБелый,					КонструкторЦвета(255, 250, 240));
	Соответствие.Вставить(WebЦвета.Циан,						КонструкторЦвета(000, 255, 255));
	Соответствие.Вставить(WebЦвета.ЦианАкварельный,				КонструкторЦвета(000, 255, 255));
	Соответствие.Вставить(WebЦвета.ЦианНейтральный,				КонструкторЦвета(000, 128, 128));
	Соответствие.Вставить(WebЦвета.ЦианСветлый,					КонструкторЦвета(224, 255, 255));
	Соответствие.Вставить(WebЦвета.ЦианТемный,					КонструкторЦвета(000, 139, 139));
	Соответствие.Вставить(WebЦвета.Черный,						КонструкторЦвета(000, 000, 000));
	Соответствие.Вставить(WebЦвета.ШелковыйОттенок,				КонструкторЦвета(255, 248, 220));
	Соответствие.Вставить(WebЦвета.Шоколадный,					КонструкторЦвета(210, 105, 30));
	
	Возврат Соответствие;
	
КонецФункции

// Конструктор создания цвета, для уменьшения срабатываний проверки правил в конфигурации АПК.
//
// Параметры:
//	Красный - Число - составляющая красного цвета.
//	Зеленый - Число - составляющая зеленого цвета.
//	Синий - Число - составляющая синего цвета.
//
// Возвращаемое значение:
//	Цвет - цвет созданный через конструктор.
//
Функция КонструкторЦвета(Знач Красный = 0, Знач Зеленый = 0, Знач Синий = 0) Экспорт
	
	Возврат Новый Цвет(Красный, Зеленый, Синий);
	
КонецФункции

#КонецОбласти