#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала, ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ) + 1) КАК ДнейОтпуска
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ВКМ_ГрафикЗапланированныхОтпусков.СоздатьМенеджерЗаписи();
	
		МенеджерЗаписи.Период = НачалоГода(ЭтотОбъект.Дата);
		МенеджерЗаписи.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		МенеджерЗаписи.Год = ЭтотОбъект.Год;
		МенеджерЗаписи.Прочитать();
		
		Если Не МенеджерЗаписи.Выбран() Тогда
			
			МенеджерЗаписи = РегистрыСведений.ВКМ_ГрафикЗапланированныхОтпусков.СоздатьМенеджерЗаписи();
		
			МенеджерЗаписи.Период = НачалоГода(ЭтотОбъект.Дата);
			МенеджерЗаписи.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			МенеджерЗаписи.Год = ЭтотОбъект.Год;
			
		КонецЕсли;
		
		МенеджерЗаписи.ДнейОтпуска = ВыборкаДетальныеЗаписи.ДнейОтпуска;

		МенеджерЗаписи.Записать();	

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти