
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Элементы.Найти("ВКМ_ГруппаАбонентскоеОбслуживание") = Неопределено Тогда
		НоваяГруппаФормы = Элементы.Добавить("ВКМ_ГруппаАбонентскоеОбслуживание", Тип("ГруппаФормы"));
		НоваяГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппаФормы.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
		НоваяГруппаФормы.ОтображатьЗаголовок = Ложь;
		НоваяГруппаФормы.ЦветФона = WebЦвета.БледноЗеленый;
		НоваяГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;		
	КонецЕсли;
	
	Если Элементы.Найти("ВКМ_ГруппаАбонентскоеОбслуживаниеДатаДействияДоговора") = Неопределено Тогда
		НоваяГруппаФормыДатаДействияДоговора = Элементы.Добавить("ВКМ_ГруппаАбонентскоеОбслуживаниеДатаДействияДоговора", Тип("ГруппаФормы"), НоваяГруппаФормы);
		НоваяГруппаФормыДатаДействияДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппаФормыДатаДействияДоговора.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
		НоваяГруппаФормыДатаДействияДоговора.ОтображатьЗаголовок = Ложь;
		НоваяГруппаФормыДатаДействияДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;		
	КонецЕсли;
	
	Если Элементы.Найти("ВКМ_ДатаНачалаДействияДоговора") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"), НоваяГруппаФормыДатаДействияДоговора);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Договор действует с";
	КонецЕсли;
		
	Если Элементы.Найти("ВКМ_ДатаОкончанияДействияДоговора") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"), НоваяГруппаФормыДатаДействияДоговора);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "по";
	КонецЕсли;
		
	Если Элементы.Найти("ВКМ_АбонентскаяПлата") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ВКМ_АбонентскаяПлата", Тип("ПолеФормы"), НоваяГруппаФормы);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Ежемесячная абонентская плата";
	КонецЕсли;
		
	Если Элементы.Найти("ВКМ_СтоимостьЧасаРаботы") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), НоваяГруппаФормы);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Стоимость часа работы специалиста";
	КонецЕсли;

	ВКМ_ВидимостьАбонентскоеОбслуживание();

КонецПроцедуры

//@skip-check module-structure-form-event-regions
&НаСервере
Процедура ВКМ_ВидимостьАбонентскоеОбслуживание()
	
	ВидимостьАбонентскоеОбслуживание = (Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
		
	Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = ВидимостьАбонентскоеОбслуживание;
	Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = ВидимостьАбонентскоеОбслуживание;
	Элементы.ВКМ_АбонентскаяПлата.Видимость = ВидимостьАбонентскоеОбслуживание;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = ВидимостьАбонентскоеОбслуживание;
	
	Если Не ВидимостьАбонентскоеОбслуживание Тогда
		
		Объект.ВКМ_ДатаНачалаДействияДоговора = Неопределено;
		Объект.ВКМ_ДатаОкончанияДействияДоговора = Неопределено;
		Объект.ВКМ_АбонентскаяПлата = Неопределено;
		Объект.ВКМ_СтоимостьЧасаРаботы = Неопределено;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОБработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)

	ВКМ_ВидимостьАбонентскоеОбслуживание();	

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		Если НачалоМесяца(ТекущийОбъект.ВКМ_ДатаНачалаДействияДоговора) >= ТекущаяДата() И
				КонецМесяца(ТекущийОбъект.ВКМ_ДатаОкончанияДействияДоговора) <= ТекущаяДата() Тогда
		
			НаборЗаписи = РегистрыСведений.ВКМ_РеализацияДоговор.СоздатьНаборЗаписей();
			
			НаборЗаписи.Отбор.Период.Установить(НачалоМесяца(ТекущаяДата()));
			НаборЗаписи.Отбор.Договор.Установить(Объект.Ссылка);
			НаборЗаписи.Прочитать();
				
			Если НаборЗаписи.Количество() = 0 Тогда
					
				МенеджерЗаписи = РегистрыСведений.ВКМ_РеализацияДоговор.СоздатьМенеджерЗаписи();
					
				МенеджерЗаписи.Период = НачалоМесяца(ТекущаяДата());
				МенеджерЗаписи.Договор = Объект.Ссылка;
					
				МенеджерЗаписи.Записать();				
					
			КонецЕсли;
				
		КонецЕсли;		
			
	Иначе
		
		НаборЗаписей=РегистрыСведений.ВКМ_РеализацияДоговор.СоздатьНаборЗаписей();
	
		НаборЗаписей.Отбор.Период.Установить(НачалоМесяца(ТекущаяДата()));
		НаборЗаписей.ОТбор.Договор.Установить(Объект.Ссылка);

		НаборЗаписей.Записать();

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
