
#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьСообщение() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
			"ВЫБРАТЬ
			|	ВКМ_ИндентификаторГруппы.Значение КАК Chat_id,
			|	ВКМ_ТокенБот.Значение КАК Token,
			|	ВКМ_УведомленияБот.Текст,
			|	ВКМ_УведомленияБот.Ссылка
			|ИЗ
			|	Константа.ВКМ_ИндентификаторГруппы КАК ВКМ_ИндентификаторГруппы,
			|	Константа.ВКМ_ТокенБот КАК ВКМ_ТокенБот,
			|	Справочник.ВКМ_УведомленияБот КАК ВКМ_УведомленияБот";
		
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		Token = Выборка.Token;
		Chat_id = Выборка.Chat_id;
		ТекстСообщения = Выборка.Текст;
		
		Адрес = "api.telegram.org";
		Соединение = Новый HTTPСоединение(Адрес, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		Данные = Новый Структура;
		Данные.Вставить("text", ТекстСообщения);
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Данные);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("content-type", "application/json");
		АдресЗапроса = "bot" + Token + "/sendMessage?chat_id=" + Формат(Chat_id, "ЧГ=");
		HTTPЗапрос = Новый HTTPЗапрос(АдресЗапроса, Заголовки);
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		Попытка
			Результат = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
			
			Если Не Результат.КодСостояния = 200 Тогда
				ВызватьИсключение "Ошибка проверки связи";
			КонецЕсли;
			
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.Удалить();
			
		Исключение
			
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"), УровеньЖурналаРегистрации.Ошибка,,,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Возврат;
							
		КонецПопытки;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти